{"pages":[{"title":"aboutme","text":"","link":"/aboutme/index.html"}],"posts":[{"title":"Searching and Optimization","text":"Searching and Optimization- 2.1 State space and Searchingworld : The object including with problem state : The meaning is situation at the special point world state space : The set of every state coming from problem’s initial state initial state : The state of giving problem - 2.2 Blind searchBlind search : The method find the solution following to fixed order 2.2.1 DFS (Depth first search)2.2.2 BFS(Breadth first search)2.2.3 Iterative deepening search2.2.4 Bidirectional search- Informed search2.3.1 Heuristic search2.3.2 Hill climbing method2.3.3 Best first search2.3.4 Beam search2.3.5 A* algorithmGame search2.4.1 Mini-max game tree2.4.2 a - b pruning2.4.3 Monte carlo tree searchConstraint satisfaction problem2.5.1 Backtracking search2.5.2 Constraint propagation- Optimization- Traveling salesperson problem2.6.1 Genetic algorithm2.6.2 Meta - heuristicFunction optimization2.6.3 Function optimization problem2.6.4 Constrained optimization problem2.6.5 Gradient descent method","link":"/2020/03/24/Optimization/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/03/19/hello-world/"},{"title":"Ubuntu","text":"Install Ubuntu on my desktopWhat is the Ubuntu?123456Ubuntu is a free and open-source Linux distribution based on Debian.Ubuntu is ofiicially released in three edition : Desktop, Server, and Core for the internet of things devices and robotsAll the editions can rub on the computer alone,or in a virtual machine-from Wikipedia- Reference Youtube linkhttps://www.youtube.com/watch?v=-hsTerGam3Y&amp;list=PLVsNizTWUw7H0hL3MIk4POxadZVwNOycL&amp;index=1 Step 01 Install the VMwareYou would be better to download VMware Workstation Pro version, Because Pro version can use snapcapture function which is back up function. When you install the VMware file, You can use workstation and player. Step 02 Build four virtual Machine Install the Server computer in VMware player Install the Server(B) computer in player install the Client computer in player Install the WinClient computer in player ** Download Server, Server(B), Client file Link &lt; https://cafe.naver.com/thisisLinux &gt; ** Download WinClient file(Win 8,1 version) Link &lt; https://cafe.naver.com/thisislinux/5277 &gt; Tip Answer from blogger .md1234내용 ```c .md내용 내용","link":"/2020/03/23/Ubuntu/"}],"tags":[],"categories":[]}